; domain
(define (domain labyrinth)
(:requirements :adl :action-costs)

(:types
    ;; card with 2 to 4 paths
    card - object
    direction - object
    ;; vertical direction: N S
    directionV - direction
    ;; horizontal directions: W E
    directionH - direction
    ;; values for positions of the card in the grid
    gridpos - object
)

(:constants
    S N - directionV
    W E - directionH
)

(:predicates
    ;; ordering of values for grid positions ?p1 = ?p2 + 1
    (NEXT ?p1 - gridpos ?p2 - gridpos)
    ;; maximal grid index
    (MAX-POS ?p - gridpos)
    ;; minimal grid index
    (MIN-POS ?p - gridpos)
    ;; moving from ?c in direction ?d is blocked by a wall
    (BLOCKED ?c - card ?d - direction)
    ;; robot is located on card ?c
    (robot-at ?c - card)
    ;; card ?c is positioned in the grid at ?x ?y
    (card-at ?c - card ?x - gridpos ?y - gridpos)
    ;; flag indicating that the robot left the maze e.i. that the goal has been reached
    (left)

    ;; flag to indicate that a card is currently moving an the robot cannot move
    (cards-moving)
    ;; flags to indicate that a row/column is rotating in the corresponding direction
    (cards-moving-west)
    (cards-moving-east)
    (cards-moving-south)
    (cards-moving-north)
    ;; the card whose position needs to be updated next while rotating
    (next-moving-card ?c - card)
    ;; the card that was removed to rotate and which needs to be placed at the beginning/end of the row/column
    (new-headtail-card ?c - card)

)

(:functions
    (total-cost) - number
    (move-robot-cost) - number
    (move-card) - number
)

;; moves the robot between to cards
(:action move-west
    :parameters (?cfrom - card ?xfrom - gridpos ?yfrom - gridpos ?dfrom - directionH ?cto - card ?xto - gridpos ?yto - gridpos ?dto - directionH)
    :precondition
        (and
            (not (cards-moving))
            (= ?dfrom w)
            (robot-at ?cfrom)
            (card-at ?cfrom ?xfrom ?yfrom)
            (card-at ?cto ?xto ?yto)
            (next ?xfrom ?xto)
            (= ?yfrom ?yto)
            (not (= ?dfrom ?dto))
            (not (blocked ?cfrom ?dfrom))
            (not (blocked ?cto ?dto))
        )
    :effect
        (and
            (not (robot-at ?cfrom))
            (robot-at ?cto)
            (increase (total-cost) (move-robot-cost))
        )
)

(:action move-east
    :parameters (?cfrom - card ?xfrom - gridpos ?yfrom - gridpos ?dfrom - directionH ?cto - card ?xto - gridpos ?yto - gridpos ?dto - directionH)
    :precondition
        (and
            (not (cards-moving))
            (= ?dfrom e)
            (robot-at ?cfrom)
            (card-at ?cfrom ?xfrom ?yfrom)
            (card-at ?cto ?xto ?yto)
            (next ?xto ?xfrom)
            (= ?yfrom ?yto)
            (not (= ?dfrom ?dto))
            (not (blocked ?cfrom ?dfrom))
            (not (blocked ?cto ?dto))
        )
    :effect
        (and
            (not (robot-at ?cfrom))
            (robot-at ?cto)
            (increase (total-cost) (move-robot-cost))
        )
)

(:action move-north
    :parameters (?cfrom - card ?xfrom - gridpos ?yfrom - gridpos ?dfrom - directionV ?cto - card ?xto - gridpos ?yto - gridpos ?dto - directionV)
    :precondition
        (and
            (not (cards-moving))
            (= ?dfrom n)
            (robot-at ?cfrom)
            (card-at ?cfrom ?xfrom ?yfrom)
            (card-at ?cto ?xto ?yto)
            (next ?yfrom ?yto)
            (= ?xfrom ?xto)
            (not (= ?dfrom ?dto))
            (not (blocked ?cfrom ?dfrom))
            (not (blocked ?cto ?dto))
        )
    :effect
        (and
            (not (robot-at ?cfrom))
            (robot-at ?cto)
            (increase (total-cost) (move-robot-cost))
        )
)

(:action move-south
    :parameters (?cfrom - card ?xfrom - gridpos ?yfrom - gridpos ?dfrom - directionV ?cto - card ?xto - gridpos ?yto - gridpos ?dto - directionV)
    :precondition
        (and
            (not (cards-moving))
            (= ?dfrom s)
            (robot-at ?cfrom)
            (card-at ?cfrom ?xfrom ?yfrom)
            (card-at ?cto ?xto ?yto)
            (next ?yto ?yfrom)
            (= ?xfrom ?xto)
            (not (= ?dfrom ?dto))
            (not (blocked ?cfrom ?dfrom))
            (not (blocked ?cto ?dto))
        )
    :effect
        (and
            (not (robot-at ?cfrom))
            (robot-at ?cto)
            (increase (total-cost) (move-robot-cost))
        )
)


;; there 3 (start, move, stop) for each direction to rotate the cards
;; rotating ends in a deadend if the card with the robot in the row/column that is rotated
;; ----------------------------------------------------------------------------------------

;; starts rotation
;; saves the card with the minimal index
;; determines which card should be updated next the corresponding move action
;; and makes all other actions inapplicable by setting cards-moving and cards-moving-west
(:action start-move-card-west
:parameters(?cm - card ?x - gridpos ?y - gridpos ?cnext - card ?nextx - gridpos)
:precondition
    (and
        (not (cards-moving))
        (not (cards-moving-west))
        (not (robot-at ?cm))
        (card-at ?cm ?x ?y )
        (min-pos ?x)
        (card-at ?cnext ?nextx ?y)
        (next ?nextx ?x)
    )
:effect
    (and
        (cards-moving)
        (cards-moving-west)
        (not (card-at ?cm ?x ?y ))
        (new-headtail-card ?cm)
        (next-moving-card ?cnext)
        (increase (total-cost) (move-card))
    )
)

;; updates the grid column index of ?cm which is the next card to update
(:action move-card-west
:parameters(?cm - card ?x - gridpos ?y - gridpos ?cnext - card ?nextx - gridpos ?prevx - gridpos)
:precondition
    (and
        (cards-moving)
        (cards-moving-west)
        (not (robot-at ?cm))
        (next-moving-card ?cm)
        (card-at ?cm ?x ?y )
        (card-at ?cnext ?nextx ?y)
        (next ?x ?prevx)
        (next ?nextx ?x)
    )
:effect
    (and
        (cards-moving)
        (cards-moving-west)
        (not (card-at ?cm ?x ?y))
        (card-at ?cm ?prevx ?y)
        (not (next-moving-card ?cm))
        (next-moving-card ?cnext)
    )
)

;; stops rotation
;; updates the grid index of the card specified by the start move action in new-headtail-card
(:action stop-move-card-west
:parameters(?cm - card ?x - gridpos ?y - gridpos ?prevx - gridpos ?newtc - card)
:precondition
    (and
        (cards-moving)
        (cards-moving-west)
        (not (robot-at ?cm))
        (next-moving-card ?cm)
        (card-at ?cm ?x ?y )
        (next ?x ?prevx)
        (max-pos ?x)
        (new-headtail-card ?newtc)
    )
:effect
    (and
        (not (cards-moving))
        (not (cards-moving-west))
        (not (card-at ?cm ?x ?y))
        (card-at ?cm ?prevx ?y)
        (card-at ?newtc ?x ?y)
        (not (new-headtail-card ?newtc))
        (not (next-moving-card ?cm))
    )
)


;; ----------------------------------------------------------------------------------------

(:action start-move-card-east
:parameters(?cm - card ?x - gridpos ?y - gridpos ?cnext - card ?nextx - gridpos)
:precondition
    (and
        (not (cards-moving))
        (not (cards-moving-east))
        (not (robot-at ?cm))
        (card-at ?cm ?x ?y )
        (max-pos ?x)
        (card-at ?cnext ?nextx ?y)
        (next ?x ?nextx)
    )
:effect
    (and
        (cards-moving)
        (cards-moving-east)
        (not (card-at ?cm ?x ?y ))
        (new-headtail-card ?cm)
        (next-moving-card ?cnext)
        (increase (total-cost) (move-card))
    )
)

(:action move-card-east
:parameters(?cm - card ?x - gridpos ?y - gridpos ?cnext - card ?nextx - gridpos ?prevx - gridpos)
:precondition
    (and
        (cards-moving)
        (cards-moving-east)
        (not (robot-at ?cm))
        (next-moving-card ?cm)
        (card-at ?cm ?x ?y )
        (card-at ?cnext ?nextx ?y)
        (next ?prevx ?x)
        (next ?x ?nextx)
    )
:effect
    (and
        (cards-moving)
        (cards-moving-east)
        (not (card-at ?cm ?x ?y))
        (card-at ?cm ?prevx ?y)
        (not (next-moving-card ?cm))
        (next-moving-card ?cnext)
    )
)

(:action stop-move-card-east
:parameters(?cm - card ?x - gridpos ?y - gridpos ?prevx - gridpos ?newtc - card)
:precondition
    (and
        (cards-moving)
        (cards-moving-east)
        (not (robot-at ?cm))
        (next-moving-card ?cm)
        (card-at ?cm ?x ?y )
        (next  ?prevx ?x)
        (min-pos ?x)
        (new-headtail-card ?newtc)
    )
:effect
    (and
        (not (cards-moving))
        (not (cards-moving-east))
        (not (card-at ?cm ?x ?y))
        (card-at ?cm ?prevx ?y)
        (card-at ?newtc ?x ?y)
        (not (new-headtail-card ?newtc))
        (not (next-moving-card ?cm))
    )
)

;; ----------------------------------------------------------------------------------------

(:action start-move-card-north
:parameters(?cm - card ?x - gridpos ?y - gridpos ?cnext - card ?nexty - gridpos)
:precondition
    (and
        (not (cards-moving))
        (not (cards-moving-north))
        (not (robot-at ?cm))
        (card-at ?cm ?x ?y )
        (min-pos ?y)
        (card-at ?cnext ?x ?nexty)
        (next ?nexty ?y)
    )
:effect
    (and
        (cards-moving)
        (cards-moving-north)
        (not (card-at ?cm ?x ?y ))
        (new-headtail-card ?cm)
        (next-moving-card ?cnext)
        (increase (total-cost) (move-card))
    )
)

(:action move-card-north
:parameters(?cm - card ?x - gridpos ?y - gridpos  ?cnext - card ?nexty - gridpos ?prevy - gridpos)
:precondition
    (and
        (cards-moving)
        (cards-moving-north)
        (not (robot-at ?cm))
        (next-moving-card ?cm)
        (card-at ?cm ?x ?y )
        (card-at ?cnext ?x ?nexty)
        (next ?y ?prevy)
        (next ?nexty ?y)
    )
:effect
    (and
        (cards-moving)
        (cards-moving-north)
        (not (card-at ?cm ?x ?y))
        (card-at ?cm ?x ?prevy)
        (not (next-moving-card ?cm))
        (next-moving-card ?cnext)
    )
)

(:action stop-move-card-north
:parameters(?cm - card ?x - gridpos ?y - gridpos ?prevy - gridpos ?newtc - card)
:precondition
    (and
        (cards-moving)
        (cards-moving-north)
        (not (robot-at ?cm))
        (next-moving-card ?cm)
        (card-at ?cm ?x ?y )
        (next ?y ?prevy)
        (max-pos ?y)
        (new-headtail-card ?newtc)
    )
:effect
    (and
        (not (cards-moving))
        (not (cards-moving-north))
        (not (card-at ?cm ?x ?y))
        (card-at ?cm ?x ?prevy)
        (card-at ?newtc ?x ?y)
        (not (new-headtail-card ?newtc))
        (not (next-moving-card ?cm))
    )
)

;; ----------------------------------------------------------------------------------------

(:action start-move-card-south
:parameters(?cm - card ?x - gridpos ?y - gridpos  ?cnext - card ?nexty - gridpos)
:precondition
    (and
        (not (cards-moving))
        (not (cards-moving-south))
        (not (robot-at ?cm))
        (card-at ?cm ?x ?y )
        (max-pos ?y)
        (card-at ?cnext ?x ?nexty)
        (next ?y ?nexty)
    )
:effect
    (and
        (cards-moving)
        (cards-moving-south)
        (not (card-at ?cm ?x ?y ))
        (new-headtail-card ?cm)
        (next-moving-card ?cnext)
        (increase (total-cost) (move-card))
    )
)

(:action move-card-south
:parameters(?cm - card ?x - gridpos ?y - gridpos  ?cnext - card ?nexty - gridpos ?prevy - gridpos)
:precondition
    (and
        (cards-moving)
        (cards-moving-south)
        (not (robot-at ?cm))
        (next-moving-card ?cm)
        (card-at ?cm ?x ?y )
        (card-at ?cnext ?x ?nexty)
        (next ?prevy ?y)
        (next ?y ?nexty)
    )
:effect
    (and
        (cards-moving)
        (cards-moving-south)
        (not (card-at ?cm ?x ?y))
        (card-at ?cm ?x ?prevy)
        (not (next-moving-card ?cm))
        (next-moving-card ?cnext)
    )
)

(:action stop-move-card-south
:parameters(?cm - card ?x - gridpos ?y - gridpos ?prevy - gridpos ?newtc - card)
:precondition
    (and
        (cards-moving)
        (cards-moving-south)
        (not (robot-at ?cm))
        (next-moving-card ?cm)
        (card-at ?cm ?x ?y )
        (next ?prevy ?y)
        (min-pos ?y)
        (new-headtail-card ?newtc)
    )
:effect
    (and
        (not (cards-moving))
        (not (cards-moving-south))
        (not (card-at ?cm ?x ?y))
        (card-at ?cm ?x ?prevy)
        (card-at ?newtc ?x ?y)
        (not (new-headtail-card ?newtc))
        (not (next-moving-card ?cm))
    )
)


;; checks whether the robot can leave the labyrinth i.e
;; whether the card the robot is currently on is in the bottom right corner
;; and the rover is in sector SE
(:action leave
:parameters(?c - card ?prow - gridpos ?pcolumn - gridpos)
:precondition
    (and
        (not (cards-moving))
        (robot-at ?c)
        (card-at ?c ?prow ?pcolumn)
        (max-pos ?prow)
        (max-pos ?pcolumn)
        (not (blocked ?c s ))
    )
:effect
    (and
        (left)
    )
)
)

; problem
(define (problem labyrinth-size-5-rotations-1-seed-0)
(:domain labyrinth)
(:objects
	pos0 pos1 pos2 pos3 pos4  - gridpos
	card0 card1 card2 card3 card4 card5 card6 card7 card8 card9 card10 card11 card12 card13 card14 card15 card16 card17 card18 card19 card20 card21 card22 card23 card24  - card
)
(:init
	(MAX-POS pos4)
	(MIN-POS pos0)

	(NEXT pos1 pos0)
	(NEXT pos2 pos1)
	(NEXT pos3 pos2)
	(NEXT pos4 pos3)

	(card-at card0 pos0 pos0)
	(card-at card1 pos1 pos0)
	(card-at card7 pos2 pos0)
	(card-at card3 pos3 pos0)
	(card-at card4 pos4 pos0)
	(card-at card5 pos0 pos1)
	(card-at card6 pos1 pos1)
	(card-at card12 pos2 pos1)
	(card-at card8 pos3 pos1)
	(card-at card9 pos4 pos1)
	(card-at card10 pos0 pos2)
	(card-at card11 pos1 pos2)
	(card-at card17 pos2 pos2)
	(card-at card13 pos3 pos2)
	(card-at card14 pos4 pos2)
	(card-at card15 pos0 pos3)
	(card-at card16 pos1 pos3)
	(card-at card22 pos2 pos3)
	(card-at card18 pos3 pos3)
	(card-at card19 pos4 pos3)
	(card-at card20 pos0 pos4)
	(card-at card21 pos1 pos4)
	(card-at card2 pos2 pos4)
	(card-at card23 pos3 pos4)
	(card-at card24 pos4 pos4)

	(BLOCKED card0 N)
	(BLOCKED card0 E)

	(BLOCKED card1 S)

	(BLOCKED card7 N)
	(BLOCKED card7 W)

	(BLOCKED card3 N)
	(BLOCKED card3 E)

	(BLOCKED card4 N)
	(BLOCKED card4 E)

	(BLOCKED card5 E)
	(BLOCKED card5 W)

	(BLOCKED card6 W)

	(BLOCKED card12 N)
	(BLOCKED card12 S)

	(BLOCKED card8 N)
	(BLOCKED card8 S)

	(BLOCKED card9 S)
	(BLOCKED card9 W)

	(BLOCKED card10 E)

	(BLOCKED card11 N)
	(BLOCKED card11 W)

	(BLOCKED card17 S)
	(BLOCKED card17 W)

	(BLOCKED card13 N)
	(BLOCKED card13 S)


	(BLOCKED card15 W)

	(BLOCKED card16 E)
	(BLOCKED card16 S)

	(BLOCKED card22 S)
	(BLOCKED card22 W)

	(BLOCKED card18 N)
	(BLOCKED card18 E)

	(BLOCKED card19 E)
	(BLOCKED card19 W)

	(BLOCKED card20 N)
	(BLOCKED card20 S)

	(BLOCKED card21 N)
	(BLOCKED card21 E)

	(BLOCKED card2 E)
	(BLOCKED card2 W)

	(BLOCKED card23 N)
	(BLOCKED card23 S)

	(BLOCKED card24 W)


	(robot-at card0)

	(= (total-cost) 0)
	(= (move-robot-cost) 1)
	(= (move-card) 1)
)
(:goal
	(and
		(left)
	)
)
	(:metric minimize (total-cost))
)

; plan
1. (start-move-card-south card2 pos2 pos4 card22 pos3)
   deleted: (card-at card2 pos2 pos4)
   added: (cards-moving) (cards-moving-south) (new-headtail-card card2) (next-moving-card card22)
   goals met: 0 of 1
2. (move-card-south card22 pos2 pos3 card17 pos2 pos4)
   deleted: (card-at card22 pos2 pos3) (next-moving-card card22)
   added: (card-at card22 pos2 pos4) (next-moving-card card17)
   goals met: 0 of 1
3. (move-card-south card17 pos2 pos2 card12 pos1 pos3)
   deleted: (card-at card17 pos2 pos2) (next-moving-card card17)
   added: (card-at card17 pos2 pos3) (next-moving-card card12)
   goals met: 0 of 1
4. (move-card-south card12 pos2 pos1 card7 pos0 pos2)
   deleted: (card-at card12 pos2 pos1) (next-moving-card card12)
   added: (card-at card12 pos2 pos2) (next-moving-card card7)
   goals met: 0 of 1
5. (stop-move-card-south card7 pos2 pos0 pos1 card2)
   deleted: (cards-moving) (cards-moving-south) (card-at card7 pos2 pos0) (new-headtail-card card2) (next-moving-card card7)
   added: (card-at card7 pos2 pos1) (card-at card2 pos2 pos0)
   goals met: 0 of 1
6. (move-south card0 pos0 pos0 s card5 pos0 pos1 n)
   deleted: (robot-at card0)
   added: (robot-at card5)
   goals met: 0 of 1
7. (move-south card5 pos0 pos1 s card10 pos0 pos2 n)
   deleted: (robot-at card5)
   added: (robot-at card10)
   goals met: 0 of 1
8. (move-south card10 pos0 pos2 s card15 pos0 pos3 n)
   deleted: (robot-at card10)
   added: (robot-at card15)
   goals met: 0 of 1
9. (move-east card15 pos0 pos3 e card16 pos1 pos3 w)
   deleted: (robot-at card15)
   added: (robot-at card16)
   goals met: 0 of 1
10. (move-north card16 pos1 pos3 n card11 pos1 pos2 s)
   deleted: (robot-at card16)
   added: (robot-at card11)
   goals met: 0 of 1
11. (move-east card11 pos1 pos2 e card12 pos2 pos2 w)
   deleted: (robot-at card11)
   added: (robot-at card12)
   goals met: 0 of 1
12. (move-east card12 pos2 pos2 e card13 pos3 pos2 w)
   deleted: (robot-at card12)
   added: (robot-at card13)
   goals met: 0 of 1
13. (move-east card13 pos3 pos2 e card14 pos4 pos2 w)
   deleted: (robot-at card13)
   added: (robot-at card14)
   goals met: 0 of 1
14. (move-south card14 pos4 pos2 s card19 pos4 pos3 n)
   deleted: (robot-at card14)
   added: (robot-at card19)
   goals met: 0 of 1
15. (move-south card19 pos4 pos3 s card24 pos4 pos4 n)
   deleted: (robot-at card19)
   added: (robot-at card24)
   goals met: 0 of 1
16. (leave card24 pos4 pos4)
   added: (left)
   goals met: 1 of 1
